Обработки/Reports/_РасшифровкаАнализСправедливойСтоимостиАктивовНеОцениваемыхПоСC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаАнализСправедливойСтоимостиАктивовНеОцениваемыхПоСC</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаАнализСправедливойСтоимостиАктивовНеОцениваемыхПоСC/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расшифровка Анализ справедливой стоимости активой, не оцениваемых по СС",
		"0.03",
		"",
		Истина,
		);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции        

Функция ПолучитьСписокСчетовДУ(ОтчетПоКлиенту) Экспорт
	
	СписокСчетовДУ = Новый Массив;
	
	Если ОтчетПоКлиенту Тогда   
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Клиент = &Клиент
		|				И СчетДоверительногоУправления.Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения >= &Период)) КАК КлиентыДоверительногоУправленияСрезПоследних";
		
		Запрос.УстановитьПараметр("Период",	ЭтотОбъект.Период);
		Запрос.УстановитьПараметр("Клиент",			ЭтотОбъект.Клиент);
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			СписокСчетовДУ.Добавить(Выборка.СчетДоверительногоУправления);
		КонецЦикла;
		
		Если СписокСчетовДУ.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет активных счетов ДУ у данного клиента");
			Возврат СписокСчетовДУ;
		КонецЕсли;
	Иначе 
		СписокСчетовДУ.Добавить(ЭтотОбъект.СчетДоверительногоУправления);
	КонецЕсли;

	Возврат СписокСчетовДУ;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ДокументРезультат = Новый ТабличныйДокумент;
		
	СписокСчетовДУ = ПолучитьСписокСчетовДУ(НастройкиОтчета.ОтчетПоКлиенту); 
	
	Если СписокСчетовДУ.Количество() > 0 Тогда 
		НастройкиОтчетаБаланс = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(ЭтотОбъект.Период, СписокСчетовДУ[0], "РегламентированныйОтчетБаланс");
		СформироватьОтчет(ДокументРезультат, НастройкиОтчетаБаланс, СписокСчетовДУ);                                                                   
		НастройкиОтчета.Вставить("Результат", ДокументРезультат); 
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьРасшифровкуАнализаСправедливойСтоимостиАктивовАМ(ВидДеятельности, СписокСчетовДУ)

	// имитация переменной СтруктураРеквизитовФормы
	Параметры = Новый Структура;
	Параметры.Вставить("мДатаКонцаПериодаОтчета",				КонецДня(ЭтотОбъект.Период));
	Параметры.Вставить("СчетДоверительногоУправления", 			СписокСчетовДУ);
	Параметры.Вставить("Клиент", 								ЭтотОбъект.Клиент);
	Параметры.Вставить("Организация", 							ЭтотОбъект.Организация);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
	Если ВидДеятельности = "СК" Тогда
		Запрос.УстановитьПараметр("СтрокаДолговыеЦБКредитныхОрганизаций", "10");
		Запрос.УстановитьПараметр("СтрокаДолговыеЦБПрочих", "15");
		Запрос.УстановитьПараметр("СтрокаСделкиРЕПОСКредитнымиОрганизациями", "12");
		Запрос.УстановитьПараметр("СтрокаСделкиРЕПОПрочие", "17");
	Иначе
		Запрос.УстановитьПараметр("СтрокаДолговыеЦБКредитныхОрганизаций", "11");
		Запрос.УстановитьПараметр("СтрокаДолговыеЦБПрочих", "16");
		Запрос.УстановитьПараметр("СтрокаСделкиРЕПОСКредитнымиОрганизациями", "13");
		Запрос.УстановитьПараметр("СтрокаСделкиРЕПОПрочие", "17");
	КонецЕсли;
	
		
	РаботаСОтчетами.ПолучитьСтоимостьЦенныхБумагУчитываемыхПоАМ_как_СС(Параметры, Запрос);
	
	Запрос.Текст = Запрос.Текст + ";" + Символы.ПС +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДанныеДляОтчета.НомерСтроки КАК НомерСтроки,
	|	_ДанныеДляОтчета.НомерКолонки КАК НомерКолонки,
	|	_ДанныеДляОтчета.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	_ДанныеДляОтчета.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА _ДанныеДляОтчета.УровеньОценки = 1
	|			ТОГДА _ДанныеДляОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУровень1,
	|	ВЫБОР
	|		КОГДА _ДанныеДляОтчета.УровеньОценки = 2
	|			ТОГДА _ДанныеДляОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУровень2,
	|	ВЫБОР
	|		КОГДА _ДанныеДляОтчета.УровеньОценки = 3
	|			ТОГДА _ДанныеДляОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУровень3,
	|	_ДанныеДляОтчета.Сумма КАК Сумма,
	|	_ДанныеДляОтчета.СуммаБаланс КАК СуммаБаланс,
	|	_ДанныеДляОтчета.Цена КАК Цена,
	|	_ДанныеДляОтчета.Купон КАК Купон,
	|	_ДанныеДляОтчета.Количество КАК Количество,
	|	_ДанныеДляОтчета.УровеньОценки КАК УровеньОценки,
	|	_ДанныеДляОтчета.ВидЦены КАК ВидЦены,
	|	_ДанныеДляОтчета.ДатаЦены КАК ДатаЦены,
	|	_ДанныеДляОтчета.СчетУчета КАК СчетУчета,
	|	_ДанныеДляОтчета.Рынок КАК Рынок,
	|	_ДанныеДляОтчета.ISIN КАК ISIN
	|ИЗ
	|	_ДанныеДляОтчета КАК _ДанныеДляОтчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ЦеннаяБумага
	|ИТОГИ
	|	СУММА(СуммаУровень1),
	|	СУММА(СуммаУровень2),
	|	СУММА(СуммаУровень3),
	|	СУММА(Сумма),
	|	СУММА(СуммаБаланс)
	|ПО
	|	НомерСтроки,
	|	УчетныйАктивЕПС
	|АВТОУПОРЯДОЧИВАНИЕ";     
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СписокСчетовДУ); 
	Запрос.УстановитьПараметр("грКонецПериода", Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая)); 
	
	Возврат Запрос.Выполнить();
	
КонецФункции  

Функция СформироватьТаблицуПоказателей(ВидДеятельности)
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	ТаблицаПоказателей.Колонки.Добавить("НомерСтроки");
	ТаблицаПоказателей.Колонки.Добавить("НомерСтрокиОтчет");
	ТаблицаПоказателей.Колонки.Добавить("Содержание");
	
	Макет = ПолучитьМакет("Показатели");
	
	ОбластьПоказатели = Макет.ПолучитьОбласть("Строки|Показатель");
	ОбластьCК = Макет.ПолучитьОбласть("Строки|СК");
	ОбластьНПФ = Макет.ПолучитьОбласть("Строки|НПФ");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(ОбластьПоказатели);
	
	Если ВидДеятельности = "СК" Тогда   
		ТабличныйДокумент.Присоединить(ОбластьCК);
	Иначе 
		ТабличныйДокумент.Присоединить(ОбластьНПФ);
	КонецЕсли;
	
	Для ИндексСтроки = 1 по ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		
		Для ИндексКолонки = 1 по 3 Цикл 
			Область = ТабличныйДокумент.ПолучитьОбласть(ИндексСтроки, ИндексКолонки);  
			
			Если ИндексКолонки = 1 Тогда
				НоваяСтрока.Содержание = Область.ТекущаяОбласть.Текст;
			ИначеЕсли ИндексКолонки = 2 Тогда   
				НоваяСтрока.НомерСтроки = Область.ТекущаяОбласть.Текст;
			ИначеЕсли ИндексКолонки = 3 Тогда
				НоваяСтрока.НомерСтрокиОтчет = Область.ТекущаяОбласть.Текст;
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаПоказателей; 
	
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат, НастройкиОтчетаБаланс, СписокСчетовДУ) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()"; 
	Если ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда 
		СтрокаПараметров = "Период,Организация,СчетДоверительногоУправления"; 
	Иначе 
		СтрокаПараметров = "Период,Организация,Клиент";
	КонецЕсли;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, СтрокаПараметров);
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
	Механизм,
	ПараметрыВыполненияДляСбораСтатистики.Хранилище,
	ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить(); 
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоказатель = Макет.ПолучитьОбласть("Показатель");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьУчетныйАктив = Макет.ПолучитьОбласть("УчетныйАктив");
	
	ВидДеятельности = НастройкиОтчетаБаланс.ВидДеятельностиОрганизации.Ключ;  
	
	ТаблицаПоказателей = СформироватьТаблицуПоказателей(ВидДеятельности);
	
	//шапка  
	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(СписокСчетовДУ[0], ЭтотОбъект.Период); 
	
	Если СписокСчетовДУ.Количество() = 1 Тогда 
		ПолеДоговорДУ = "Договор доверительного управления: ";
	Иначе
		ПолеДоговорДУ = "Договоры доверительного управления: "; 
	КонецЕсли;
	
	СписокДоговоровДУ = "";
	Для Каждого ЭлементМассива из СписокСчетовДУ Цикл 
		СписокДоговоровДУ = СписокДоговоровДУ + ЭлементМассива.НомерДоговора + ", ";
	КонецЦикла;
	СписокДоговоровДУ = Лев(СписокДоговоровДУ, СтрДлина(СписокДоговоровДУ)-2);
	
	ОбластьШапка.Параметры.ПериодОтчета 	= Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
	
	ОбластьШапка.Параметры.УчредительУправления = НаименованияКлиента.КраткоеНаименование; 
	ОбластьШапка.Параметры.ДоверительныйУправляющий = ЭтотОбъект.Организация;  
	ОбластьШапка.Параметры.ПолеДоговорДУ = ПолеДоговорДУ;
    ОбластьШапка.Параметры.СписокДоговоровДУ = СписокДоговоровДУ;
	
	
	ДокументРезультат.Вывести(ОбластьШапка); 

	
	РезультатЗапроса = ПолучитьРасшифровкуАнализаСправедливойСтоимостиАктивовАМ(ВидДеятельности, СписокСчетовДУ); 
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока Выборка.Следующий() Цикл  
		
		СтрокаТаблицыПоказателей = ТаблицаПоказателей.Найти(Выборка.НомерСтроки, "НомерСтроки"); 
		ЗаполнитьЗначенияСвойств(ОбластьПоказатель.Параметры, СтрокаТаблицыПоказателей, "НомерСтрокиОтчет, Содержание");
		ЗаполнитьЗначенияСвойств(ОбластьПоказатель.Параметры, Выборка, "Сумма, СуммаБаланс, СуммаУровень1, СуммаУровень2, СуммаУровень3");  
		
		ДокументРезультат.Вывести(ОбластьПоказатель); 
		
		ВыборкаУчетныйАктив = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаУчетныйАктив.Следующий() Цикл
			
			Если СтрНайти("12, 13, 17", Выборка.НомерСтроки) = 0 Тогда
				ЗаполнитьЗначенияСвойств(ОбластьУчетныйАктив.Параметры, ВыборкаУчетныйАктив);
				ДокументРезультат.Вывести(ОбластьУчетныйАктив);   
				//для РЕПО учетный актив = NULL, его не выводим. 
			КонецЕсли;
			
			ДетальныеЗаписи = ВыборкаУчетныйАктив.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ДетальныеЗаписи.Следующий() Цикл  
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ДетальныеЗаписи);
				ОбластьСтрока.Параметры.УровеньОценки = "Уровень " + ДетальныеЗаписи.УровеньОценки;
				ДокументРезультат.Вывести(ОбластьСтрока);
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
